#include "usartx.h"
//#include "drive_motor.h"
#include "delay.h"
//#include "way_discern.h"
//#include "pid.h"

/*********³õÊ¼F3==1ÎªÕýÖÐ¼ä***********/
/**************************Ç°½øÑ²Ïß**************************/


extern int rho_err,theta_err;//
extern int openmv_date[4];
extern int left_flag;
extern int right_flag;




/**************************×¢Òâ**************************/
//¸ÐÎªÄÇ¿é»Ò¶ÈºÍ¹¤×÷ÊÒµÄ0ºÍ1ÊÇ·´¹ýÀ´µÄ£¬Òª×¢Òâ±àÊ±µÄÅÐ¶ÏÌõ¼þ
/**************************×¢Òâ**************************/


void g_run35(void)
{


//	     if(F1==1&&F2==1&&F3==1&&F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   Set_Motor(32,32);
//	  //ÓÒÆ«
//  else if(F1==1&&F2==1&&F3==1&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)  { Set_Motor(32,62);}
//  else if(F1==1&&F2==1&&F3==0&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(24,68);}
//  else if(F1==1&&F2==1&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(18,72);
//  else if(F1==1&&F2==0&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(18,76);
//  else if(F1==1&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(18,80);
//  else if(F1==0&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(0,50);
//  else if(F1==0&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(-32,32);
//	  //×óÆ« 
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==1&&F7==1&&F8==1)   {Set_Motor(62,32);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Set_Motor(68,24);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)   Set_Motor(72,18);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)   Set_Motor(76,18);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   Set_Motor(80,18);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==0)   Set_Motor(50,0);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==0)   Set_Motor(32,-32);

//  else                                                             Set_Motor(32,32);
//	  
	  
}

void g_run28(void)
{
//	     if(F1==1&&F2==1&&F3==1&&F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   Drive_Motor(0.2,0.2,0.2,0.2);
//	  //ÓÒÆ«
//  else if(F1==1&&F2==1&&F3==1&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)  { Drive_Motor(0.2,0.2,0.25,0.25);}
//  else if(F1==1&&F2==1&&F3==0&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Drive_Motor(0.2,0.2,0.28,0.28);}
//  else if(F1==1&&F2==1&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0.2,0.2,0.31,0.31);
//  else if(F1==1&&F2==0&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0.2,0.2,0.34,0.34);
//  else if(F1==1&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0.2,0.2,0.39,0.39);
//  else if(F1==0&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0,0,0.2,0.2);
//  else if(F1==0&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(-0.2,-0.2,0.2,0.2);
//	  //×óÆ« 
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==1&&F7==1&&F8==1)   {Drive_Motor(0.25,0.25,0.2,0.2);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Drive_Motor(0.28,0.28,0.2,0.2);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)    Drive_Motor(0.31,0.31,0.2,0.2);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)    Drive_Motor(0.34,0.34,0.2,0.2);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)    Drive_Motor(0.39,0.39,0.2,0.2);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==0)    Drive_Motor(0.2,0.2,0,0);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==0)    Drive_Motor(0.2,0.2,-0.2,-0.2);

//  else                                                             Drive_Motor(0.2,0.2,0.2,0.2);
  	  
	     if(F1==1&&F2==1&&F3==1&&F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   Drive_Motor(0.4,0.4,0.4,0.4);
	  //ÓÒÆ«
  else if(F1==1&&F2==1&&F3==1&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)  { Drive_Motor(0.4,0.4,0.53,0.53);vTaskDelay(4);}
  else if(F1==1&&F2==1&&F3==0&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Drive_Motor(0.4,0.4,0.57,0.57);vTaskDelay(2);}
  else if(F1==1&&F2==1&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0.4,0.4,0.62,0.62);
  else if(F1==1&&F2==0&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0.4,0.4,0.68,0.68);
  else if(F1==1&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0.4,0.4,0.75,0.75);
  else if(F1==0&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(0,0,0.6,0.6);
  else if(F1==0&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Drive_Motor(-0.4,-0.4,0.4,0.4);
	  //×óÆ« 
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==1&&F7==1&&F8==1)   {Drive_Motor(0.53,0.53,0.4,0.4);vTaskDelay(4);}
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Drive_Motor(0.57,0.57,0.4,0.4);vTaskDelay(2);}
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)    Drive_Motor(0.62,0.62,0.4,0.4);
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)    Drive_Motor(0.68,0.68,0.4,0.4);
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)    Drive_Motor(0.75,0.75,0.4,0.4);
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==0)    Drive_Motor(0.6,0.6,0,0);
  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==0)    Drive_Motor(0.4,0.4,-0.4,-0.4);

  else                                                             Drive_Motor(0.4,0.4,0.4,0.4);
  
}
void g_run23(void)
{
//	   if(F1==1&&F2==1&&F3==1&&F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   Set_Motor(23,23);
//	  //ÓÒÆ«
//  else if(F1==1&&F2==1&&F3==1&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)  { Set_Motor(23,50);}
//  else if(F1==1&&F2==1&&F3==0&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(23,54);}
//  else if(F1==1&&F2==1&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(23,59);
//  else if(F1==1&&F2==0&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(23,62);
//  else if(F1==1&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(23,65);
//  else if(F1==0&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(0,30);
//  else if(F1==0&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(-23,23);
//	  //×óÆ« 
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==1&&F7==1&&F8==1)   {Set_Motor(50,23);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Set_Motor(54,23);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)   Set_Motor(59,23);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)   Set_Motor(62,23);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   Set_Motor(65,23);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==0)   Set_Motor(30,0);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==0)   Set_Motor(23,-23);

//  else                                                             Set_Motor(23,23);
}
void white_g_run23(void)
{
//	   if(F3==1&&F4==0&&F5==0&&F6==1)   Set_Motor(23,23);
//	  //ÓÒÆ«
//  else if(F3==1&&F4==0&&F5==1&&F6==1)  { Set_Motor(22,50);}
//  else if(F3==0&&F4==0&&F5==1&&F6==1)   {Set_Motor(21,54);}
//  else if(F3==0&&F4==1&&F5==1&&F6==1)   Set_Motor(20,59);
////  else if(F3==0&&F4==1&&F5==1&&F6==1)    Set_Motor(20,64);
////  else if(F3==1&&F4==1&&F5==1&&F6==1)    Set_Motor(20,70);
////  else if(F3==1&&F4==1&&F5==1&&F6==1)   Set_Motor(0,20);
////  else if(F3==1&&F4==1&&F5==1&&F6==1)   Set_Motor(-23,23);
//	  //×óÆ« 
//  else if(F3==1&&F4==1&&F5==0&&F6==1)   {Set_Motor(50,22);}
//  else if(F3==1&&F4==1&&F5==0&&F6==0)   {Set_Motor(54,21);}
//  else if(F3==1&&F4==1&&F5==1&&F6==0)   Set_Motor(59,20);
////  else if(F3==1&&F4==1&&F5==1&&F6==0)   Set_Motor(64,20);
////  else if(F3==1&&F4==1&&F5==1&&F6==1)   Set_Motor(70,20);
////  else if(F3==1&&F4==1&&F5==1&&F6==1)   Set_Motor(20,0);
////  else if(F3==1&&F4==1&&F5==1&&F6==1)   Set_Motor(23,-23);

//  else                                   Set_Motor(23,23);
}



void g_run26(void)
{
//	   if(F1==1&&F2==1&&F3==1&&F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   Set_Motor(27,27);
//	  //ÓÒÆ«
//  else if(F1==1&&F2==1&&F3==1&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)  { Set_Motor(26,58);}
//  else if(F1==1&&F2==1&&F3==0&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(25,64);}
//  else if(F1==1&&F2==1&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(24,69);
//  else if(F1==1&&F2==0&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(23,76);
//  else if(F1==1&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(22,82);
//  else if(F1==0&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(0,60);
//  else if(F1==0&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(-27,27);
//	  //×óÆ« 
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==1&&F7==1&&F8==1)   {Set_Motor(58,26);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Set_Motor(64,25);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)   Set_Motor(69,24);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)   Set_Motor(76,23);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   Set_Motor(82,22);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==0)   Set_Motor(60,0);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==0)   Set_Motor(27,-27);

//  else                                                             Set_Motor(27,27);
}

void white_g_run26(void)
{

//	  

////  else if(F4==1&&F5==1&&F6==0&&F7==0&&F8==1)   Set_Motor(61,23);
////  else if(F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   Set_Motor(65,22);
////  else if(F4==1&&F5==1&&F6==1&&F7==0&&F8==0)   Set_Motor(40,0);
////  else if(F4==1&&F5==1&&F6==1&&F7==1&&F8==0)   Set_Motor(27,-27);
//       if(F3==1&&F4==0&&F5==0&&F6==1)   Set_Motor(25,25);
//	  //ÓÒÆ«
//  else if(F3==1&&F4==0&&F5==1&&F6==1)  { Set_Motor(24,50);}
//  else if(F3==0&&F4==0&&F5==1&&F6==1)   {Set_Motor(23,57);}
//  else if(F3==0&&F4==1&&F5==1&&F6==1)   {Set_Motor(22,64);}
//	  //×óÆ« 
//  else if(F3==1&&F4==1&&F5==0&&F6==1)   {Set_Motor(50,24);}
//  else if(F3==1&&F4==1&&F5==0&&F6==0)   {Set_Motor(57,23);}
//  else if(F3==1&&F4==1&&F5==1&&F6==0)   Set_Motor(64,22);
//  else                                                             Set_Motor(25,25);
}

void zuo_g_run26(void)
{
//	   if(F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)   Set_Motor(24,24);
//	  //ÓÒÆ«
////  else if(F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)   {Set_Motor(26,47);}
//  else if(F4==1&&F5==0&&F6==0&&F7==0&&F8==1)   Set_Motor(24,24);
//  else if(F4==0&&F5==0&&F6==0&&F7==0&&F8==1)   Set_Motor(24,24);
//  else if(F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Set_Motor(24,51);}//51
//  else if(F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   {Set_Motor(24,57);}//57
//  else if(F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(24,62);}//62
////  else if(F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(24,69);}
//  
//	  //×óÆ« 
////  else if(F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   {Set_Motor(58,26);}
//  else if(F4==1&&F5==1&&F6==1&&F7==0&&F8==0)   {Set_Motor(62,24);}
//  else if(F4==1&&F5==1&&F6==1&&F7==1&&F8==0)    Set_Motor(69,24);
//  else                                                 Set_Motor(24,24);


}
	
void zuo_g_anti_run24(void)
{
//	    if(D1==1&&D2==0&&D3==0&&D4==1&&D5==1&&D6==1&&D7==1)  Set_Motor(-24,-24);
//	  //ÓÒÆ«
////  else if(F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)   {Set_Motor(26,47);}
//  else if(D1==1&&D2==0&&D3==1&&D4==1&&D5==1)   Set_Motor(-53,-24);//53
//  else if(D1==0&&D2==0&&D3==1&&D4==1&&D5==1)   Set_Motor(-58,-24);//58
//  else if(D1==0&&D2==1&&D3==1&&D4==1&&D5==1)   Set_Motor(-63,-24);//63
////  else if(F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(24,69);}
//  
//	  //×óÆ« 
////  else if(F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   {Set_Motor(58,26);}
//  else if(D1==1&&D2==1&&D3==0&&D4==1&&D5==1)  {Set_Motor(-24,-38);}
//  else if(D1==1&&D2==1&&D3==0&&D4==0&&D5==1)    Set_Motor(-24,-42);
//  else if(D1==1&&D2==1&&D3==1&&D4==0&&D5==1)  {Set_Motor(-24,-46);}
//  else if(D1==1&&D2==1&&D3==1&&D4==0&&D5==0)    Set_Motor(-24,-48);
//  else if(D1==1&&D2==1&&D3==1&&D4==1&&D5==0)  {Set_Motor(-24,-52);}
////  else if(D1==1&&D2==1&&D3==1&&D4==1&&D5==0)    Set_Motor(-24,-56);
////  else if(D1==1&&D2==1&&D3==1&&D4==1&&D5==1)  {Set_Motor(-24,-60);}
////  else if(D1==1&&D2==1&&D3==1&&D4==1&&D5==1)    Set_Motor(-24,-68);
//  else                                                 Set_Motor(-24,-24);


}

void g_anti_run286lu(void)
{    
////³µÕý
//  if(D2==1&&D3==1&&D4==0&&D5==0&&D6==1&&D7==1)   Set_Motor(-24,-24);
////ÓÒÆ«
//  else if(D2==1&&D3==1&&D4==0&&D5==1&&D6==1&&D7==1)   Set_Motor(-53,-24);
//  else if(D2==1&&D3==0&&D4==0&&D5==1&&D6==1&&D7==1)   Set_Motor(-58,-24);
//  else if(D2==1&&D3==0&&D4==1&&D5==1&&D6==1&&D7==1)   Set_Motor(-63,-24);
//  else if(D2==0&&D3==0&&D4==1&&D5==1&&D6==1&&D7==1)   Set_Motor(-68,-24);
//  else if(D2==0&&D3==1&&D4==1&&D5==1&&D6==1&&D7==1)   Set_Motor(-24,24);

//	
////×óÆ«
//  else if(D2==1&&D3==1&&D4==1&&D5==0&&D6==1&&D7==1)   Set_Motor(-24,-53);//53
//  else if(D2==1&&D3==1&&D4==1&&D5==0&&D6==0&&D7==1)   Set_Motor(-24,-58);//58
//  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==1)   Set_Motor(-24,-63);//59
//  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==0)   Set_Motor(-24,-68); //65
//  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==1&&D7==0)   Set_Motor(24,-24); 	
//  else                                  Set_Motor(-26,-26);
	
	 if(D2==1&&D3==1&&D4==0&&D5==0&&D6==1&&D7==1)   Drive_Motor(-0.4,-0.4,-0.4,-0.4);
//ÓÒÆ«
  else if(D2==1&&D3==1&&D4==0&&D5==1&&D6==1&&D7==1)   Drive_Motor(-0.45,-0.45,-0.4,-0.4);
  else if(D2==1&&D3==0&&D4==0&&D5==1&&D6==1&&D7==1)   Drive_Motor(-0.48,-0.48,-0.4,-0.4);
  else if(D2==1&&D3==0&&D4==1&&D5==1&&D6==1&&D7==1)   Drive_Motor(-0.51,-0.51,-0.4,-0.4);
  else if(D2==0&&D3==0&&D4==1&&D5==1&&D6==1&&D7==1)   Drive_Motor(-0.54,-0.54,-0.4,-0.4);
  else if(D2==0&&D3==1&&D4==1&&D5==1&&D6==1&&D7==1)   Drive_Motor(-0.59,-0.59,-0.4,-0.4);

//×óÆ«
  else if(D2==1&&D3==1&&D4==1&&D5==0&&D6==1&&D7==1)   Drive_Motor(-0.4,-0.4,-0.45,-0.45);//53
  else if(D2==1&&D3==1&&D4==1&&D5==0&&D6==0&&D7==1)   Drive_Motor(-0.4,-0.4,-0.48,-0.48);//58
  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==1)   Drive_Motor(-0.4,-0.4,-0.51,-0.51);//59
  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==0)   Drive_Motor(-0.4,-0.4,-0.54,-0.54);//65
  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==1&&D7==0)   Drive_Motor(-0.4,-0.4,-0.59,-0.59);	
  else                                 Drive_Motor(-0.4,-0.4,-0.4,-0.4);
	
	
}


void wg_anti_run286lu(void)
{    
////³µÕý
//  if(D2==1&&D3==1&&D4==1&&D5==0&&D6==0&&D7==1)   Set_Motor(-26,-26);
////ÓÒÆ«
//  else if(D2==1&&D3==1&&D4==1&&D5==0&&D6==1&&D7==1)   Set_Motor(-53,-24);
//  else if(D2==1&&D3==1&&D4==0&&D5==0&&D6==1&&D7==1)   Set_Motor(-58,-24);
//  else if(D2==1&&D3==1&&D4==0&&D5==1&&D6==1&&D7==1)   Set_Motor(-63,-24);
//  else if(D2==1&&D3==0&&D4==0&&D5==1&&D6==1&&D7==1)   Set_Motor(-68,-24);
//  else if(D2==1&&D3==0&&D4==1&&D5==1&&D6==1&&D7==1)   Set_Motor(-24,24);

//	
////×óÆ«
//  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==1)   Set_Motor(-24,-53);//53
//  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==0)   Set_Motor(-24,-58);//58
//  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==1&&D7==0)   Set_Motor(-24,-63);//59
////  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==0&&D7==0)   Set_Motor(-24,-68); //65
////  else if(D2==1&&D3==1&&D4==1&&D5==1&&D6==1&&D7==0)   Set_Motor(24,-24); 	
//  else                                  Set_Motor(-26,-26);
	
	
	
}











void g_run45(void)
{

//	     if(F1==1&&F2==1&&F3==1&&F4==0&&F5==0&&F6==1&&F7==1&&F8==1)   Set_Motor(45,45);
//	  //ÓÒÆ«
//  else if(F1==1&&F2==1&&F3==1&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)  { Set_Motor(45,68);}
//  else if(F1==1&&F2==1&&F3==0&&F4==0&&F5==1&&F6==1&&F7==1&&F8==1)   {Set_Motor(45,72);}
//  else if(F1==1&&F2==1&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(45,75);
//  else if(F1==1&&F2==0&&F3==0&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(45,78);
//  else if(F1==1&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)    Set_Motor(45,80);
//  else if(F1==0&&F2==0&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(0,65);
//  else if(F1==0&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==1)   Set_Motor(-45,45);
//	  //×óÆ« 
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==1&&F7==1&&F8==1)   {Set_Motor(68,45);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==0&&F6==0&&F7==1&&F8==1)   {Set_Motor(72,45);}
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==1&&F8==1)   Set_Motor(75,45);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==0&&F7==0&&F8==1)   Set_Motor(78,45);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==1)   Set_Motor(80,45);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==0&&F8==0)   Set_Motor(65,0);
//  else if(F1==1&&F2==1&&F3==1&&F4==1&&F5==1&&F6==1&&F7==1&&F8==0)   Set_Motor(45,-45);

//  else                                                             Set_Motor(45,45);
	

  
	  
}
//void Camera_Speed1()
//{
//if(rho_err<=3)
//{
//	if(openmv_date[0]>0)
//	Set_Motor(28,25);
//	else
//	Set_Motor(25,28);
//}

//	else if(rho_err<=5&&rho_err>3)
//{
//	if(openmv_date[0]>0)
//	Set_Motor(35,25);
//	else
//	Set_Motor(25,35);
//}
//else if(rho_err<=10&&rho_err>5)
//{
//	if(openmv_date[0]>0)
//	Set_Motor(40,25);
//	else
//	Set_Motor(25,40);
//}
//else if(rho_err<=20&&rho_err>10){
//	if(openmv_date[0]>0)
//	Set_Motor(50,25);
//	else
//	Set_Motor(25,50);
//}
//else if(rho_err<=30&&rho_err>20){
//	if(openmv_date[0]>0)
//	Set_Motor(55,25);
//	else
//	Set_Motor(25,55); 
//}
//else {
//	if(openmv_date[0]>0)
//	Set_Motor(60,25);
//	else
//	Set_Motor(25,60);
//}
//}
